
/**************************
 * rpws_archive_example.c *
 *     WBR_WFR_LIST.C     *
 **************************/
#include <unistd.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>

#include <SpiceUsr.h>

/**************************************************/

/*  If you want to use SPICE to display time      */

/*    calculated from SCLK, turn on the following:*/
#define SPICE /**/

/*  This will require, of course, that you have   */

/*    access to the spice library on your system  */

/*    Obviously, if it doesn't like the spice     */

/*    calls, you will need to make this line      */

/*    into a comment an skip use of spice         */

/**************************************************/

/************************************************/

/*  This define enables the display of		*/

/*  raw data.					*/
#define _raw_ /**/

/************************************************/

/************************************************/

/*  This define enables the display of		*/

/*  calibrated data				*/

/* #define _calibrated_			      /**/

/************************************************/

/************************************************/

/*  This define limits the number of records	*/

/*    taht are dumped to 10 			*/

/* #define _limited_			      /**/

/************************************************/

/*****************************************************/

/* #include "$PREFIX/include/archive.h" */

/*****************************************************/

/*
 *	Defines the WBR/WFR header fields
 *	Complier MUST be instructed to pack things, else it
 *	  may place everything on architecture-specific optimal boundaries
 *	  (won't work at all well, if this happens)
 */
#pragma pack(1)
  struct archive_event_time
{
  unsigned short days;
  unsigned long msec_of_day;
};
struct archive_event_clock
{
  unsigned long seconds;
  unsigned char partition;
  unsigned char fine;
};

 /*
  *     The "time_series" union maps both WBR and
  *     WFR samples so we don't have to do the
  *     byte re-arranging
  */
struct ARCHIVE_TIME_SERIES
{
  struct archive_event_clock sclk;      /*  1 */
  struct archive_event_time scet;       /*  7 */
  unsigned short record_bytes;          /* 13 */
  unsigned short samples;               /* 15 */
  unsigned short data_rti;              /* 17 */
  unsigned char validity_flag;          /* 19 */
  unsigned char status_flag;            /* 20 */
  unsigned char frequency_band;         /* 21 */
  unsigned char gain;                   /* 22 */
  unsigned char antenna;                /* 23 */
  unsigned char agc;                    /* 24 */
  unsigned char hfr_xlate;              /* 25 */
  unsigned char sub_rti;                /* 26 */
  unsigned char lp_dac_0;               /* 27 */
  unsigned char lp_dac_1;               /* 28 */
  unsigned char fsw_ver;                /* 29 */
  unsigned char spare[3];               /* 30 */
  union
  {
    unsigned char sample[1];            /* 33 */
    unsigned char wbr_sample[1];        /* 33 */
    unsigned short wfr_sample[1];       /* 33 */
  } time_series;
};

#pragma pack()

/****************************************************************/

/*   1  |    2  |    3  |    4  |    5  |    6  |    7  |    8  */

/****************************************************************\
 *   7  |    6  |    5  |    4  |    3  |    2  |    1  |    0  *
 *	|	|	|	|	|	|	|	*
 *  MSF |   WBR |   WFR | WALSH |   SUB |   HFR |   LP  |   LP  *
 *	|	|	|	|   RTI | XLATE | DAC 0	| DAC 1	*
 *\    / \     / \     / \     / \     / \     / \     / \     /*
 * \  /   \   /   \   /   \   /   \   /   \   /   \   /   \   / *
 *  \/     \ /     \ /     \ /     \ /     \ /     \ /     \ /  *************
 *   \      \       \       \       \       \       \       +--- L/P DAC 0  *
 *    \      \       \       \       \       \       \           valid data *
 *     \      \       \       \       \       \       +--------- L/P DAC 1  *
