/* This program has hand different names: */
/* rpws_archive_example.c, WBR_WFR_LIST.C, rpws_hrpds_list.c */

#include <unistd.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>

#include <sys/types.h>
#include <sys/stat.h>
#include <errno.h>

#include <SpiceUsr.h>

/************************************************************************/
/*                                                                      */
/* Compiling                                                            */
/* Sun (sparc)                                                          */
/*  cc Ae -g -I/path/to/cspice/include rpws_hrpds_list.c \              */
/*     /path/to/cspice.a -o rpws_hrpds_list                             */
/*                                                                      */
/* Linux (x86_64)                                                       */
/*  gcc -Wall -g -I/path/to/cspice/include rpws_hrpds_list.c \          */
/*      /path/to/cspice.a -o rpws_hrpds_list                            */
/*                                                                      */
/************************************************************************/

/* Turns on spice time conversions for the output */
#define SPICE


/* Use typedefs the keep the data width sizes straight */
typedef unsigned short int uint2;
typedef unsigned int uint4;
typedef unsigned char byte;

/**********************************************
 **                                          **
 **   #pragma pack(1) tells the compiler     **
 ** to pack the structure into memory with   **
 ** NO PADDING.  Since we have settled on    **
 ** ARCHIVE_TIME_V1, the structure           **
 ** ARCHIVE_TIME_SERIES must be exactly 32   **
 ** bytes in length or things won't work    
 **
 ** TODO: Example code needs to be fixed to not be so compiler dependent.
 **       -cwp 2012-03-29
 **                                          **
 ** Later, #pragma pack() tells the          **
 ** compiler that it is free to resume       **
 ** performing memory allocation             **
 ** optmizations                             **
 **********************************************/
#pragma pack(1)
struct archive_event_time {
	uint2 days;
	uint4 msec_of_day;
};

struct archive_event_clock {
	uint4 seconds;
	byte partition;
	byte fine;
};

struct SPICE_TIME {
	int year;
	int doy;
	int d100;
	int days;
	int msec_of_day;
	int hours;
	int minutes;
	int seconds;
	int milliseconds;
};

/********************************************************************
 *****  ARCHIVE_TIME_V1         selected 3/2003                 *****
 *****          Expresses time in the format supplied in the    *****
 *****          CHDO headers attached to raw data.  It is       *****
 *****          days/milliseconds(of day) from 1/1/1958         *****
 *****                                                          *****
 ********************************************************************/
#define ARCHIVE_TIME_SERIES_EXPECTED_SIZE 224
struct ARCHIVE_TIME_SERIES {
	struct archive_event_clock sclk;	/* 1 */
	struct archive_event_time scet;	/* 7 */
	uint2 record_bytes; /* 13 */
	uint2 samples;		  /* 15 */
	uint2 data_rti;	  /* 17 */
	byte validity_flag; /* 19 */
	byte status_flag;	  /* 20 */
	byte frequency_band;	/* 21 */
	byte gain;			  /* 22 */
	byte antenna;		  /* 23 */
	byte agc;			  /* 24 */
	byte hfr_xlate;	  /* 25 */
	byte sub_rti;		  /* 26 */
	byte lp_dac_0;		  /* 27 */
	byte lp_dac_1;		  /* 28 */
	byte fsw_ver;		  /* 29 */
	byte spare[3];		  /* 30 */
	union {
		byte byte_sample[192];	/* 33 */
		uint2 word_sample[96];	/* 33 */
		byte hsk_sample[192];	/* 33 */
		byte wbr_sample[192];	/* 33 */
		uint2 wfr_sample[96];	/* 33 */
	} time_series;
};

#pragma pack()

  /* WFR data frame offsets, shifts and mask values */
  /* INDEX values are reative to the minipacket */

  /* 
   *     bits 16-23      Index into minipacket
   *     bits 8-15       Shift count
   *     bits 0-7        Mask
   */

/*****************************************************************/
/*   1  |    2  |    3  |    4  |    5  |    6  |    7  |    8   */
/*****************************************************************\
 *   7  |    6  |    5  |    4  |    3  |    2  |    1  |    0  |*
 *      |       |       |       |       |       |       |       |*
 *  MSF |   WBR |   WFR | WALSH |   SUB |   HFR |   LP  |   LP  |*
 *      |       |       |       |   RTI | XLATE | DAC 0 | DAC 1 |*
 *\    / \     / \     / \     / \     / \     / \     / \     / *
 * \  /   \   /   \   /   \   /   \   /   \   /   \   /   \   /  *
 *  \/     \ /     \ /     \ /     \ /     \ /     \ /     \ /   *************
